---
kind: property
id: P:Autodesk.Revit.DB.MaterialNode.Color
zh: 着色、上色、染色、填色
source: html/e565414b-7191-0bc9-f6a7-e4ea0059235a.htm
---
# Autodesk.Revit.DB.MaterialNode.Color Property

**中文**: 着色、上色、染色、填色

The color the material is being rendered at

## Syntax (C#)
```csharp
public Color Color { get; }
```

## Remarks
The value may differ from the default color property of the material,
 because it might have been overridden by rendering settings.